vmux0.0.13-pre/ycsbVMs_ycsb_64vms_vmux-vdpdk_-1rps_rep0/vm27.log
/nix/store/2vwkssqpzykk37r996cafq7x63imf4sp-openjdk-21+35/bin/java  -classpath /nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/conf:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/core-0.17.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/HdrHistogram-2.1.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/htrace-core4-4.1.0-incubating.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-core-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-mapper-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/commons-pool2-2.4.2.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/jedis-2.9.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6381 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
Command line: -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6381 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
YCSB Client 0.17.0

Loading workload...
Starting test.
Maximum execution time specified as: 61 secs
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2025-04-02 01:37:42:316 0 sec: 0 operations; est completion in 0 second 
2025-04-02 01:37:52:111 10 sec: 77926 operations; 7792.6 current ops/sec; est completion in 15 hours 18 minutes [READ: Count=38905, Max=27039, Min=59, Avg=121, 90=175, 99=454, 99.9=3225, 99.99=6891] [UPDATE: Count=39046, Max=38847, Min=57, Avg=122.12, 90=176, 99=525, 99.9=3353, 99.99=8695] 
2025-04-02 01:38:02:111 20 sec: 136806 operations; 5888 current ops/sec; est completion in 17 hours 26 minutes [READ: Count=29485, Max=5007, Min=58, Avg=167.53, 90=257, 99=459, 99.9=1900, 99.99=3807] [UPDATE: Count=29370, Max=4779, Min=56, Avg=167.09, 90=261, 99=460, 99.9=2471, 99.99=3795] 
2025-04-02 01:38:12:111 30 sec: 200834 operations; 6402.8 current ops/sec; est completion in 17 hours 48 minutes [READ: Count=32082, Max=4691, Min=59, Avg=155.93, 90=230, 99=338, 99.9=747, 99.99=3677] [UPDATE: Count=31946, Max=9231, Min=58, Avg=153.13, 90=226, 99=338, 99.9=833, 99.99=3705] 
2025-04-02 01:38:22:111 40 sec: 262982 operations; 6214.8 current ops/sec; est completion in 18 hours 8 minutes [READ: Count=30919, Max=3807, Min=61, Avg=159.94, 90=233, 99=341, 99.9=1184, 99.99=3437] [UPDATE: Count=31229, Max=8135, Min=57, Avg=158.6, 90=231, 99=338, 99.9=1657, 99.99=4083] 
2025-04-02 01:38:32:111 50 sec: 316931 operations; 5394.9 current ops/sec; est completion in 18 hours 48 minutes [READ: Count=26733, Max=5887, Min=60, Avg=185.37, 90=276, 99=440, 99.9=665, 99.99=3695] [UPDATE: Count=27216, Max=5547, Min=58, Avg=181.53, 90=268, 99=434, 99.9=690, 99.99=4091] 
2025-04-02 01:38:42:111 60 sec: 374541 operations; 5761 current ops/sec; est completion in 19 hours 5 minutes [READ: Count=28903, Max=4471, Min=58, Avg=172.58, 90=256, 99=393, 99.9=824, 99.99=3347] [UPDATE: Count=28707, Max=4723, Min=59, Avg=171.09, 90=254, 99=407, 99.9=870, 99.99=3531] 
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
2025-04-02 01:38:43:133 61 sec: 384025 operations; 9279.84 current ops/sec; est completion in 18 hours 56 minutes [READ: Count=4742, Max=10255, Min=59, Avg=106.3, 90=121, 99=200, 99.9=1431, 99.99=10255] [CLEANUP: Count=1, Max=1100, Min=1100, Avg=1100, 90=1100, 99=1100, 99.9=1100, 99.99=1100] [UPDATE: Count=4742, Max=3579, Min=59, Avg=105.97, 90=120, 99=204, 99.9=2779, 99.99=3579] 
[OVERALL], RunTime(ms), 61027
[OVERALL], Throughput(ops/sec), 6292.706506955938
[TOTAL_GCS_Copy], Count, 35
[TOTAL_GC_TIME_Copy], Time(ms), 27
[TOTAL_GC_TIME_%_Copy], Time(%), 0.04424271224212234
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 35
[TOTAL_GC_TIME], Time(ms), 27
[TOTAL_GC_TIME_%], Time(%), 0.04424271224212234
[READ], Operations, 191769
[READ], AverageLatency(us), 156.66084195047165
[READ], MinLatency(us), 58
[READ], MaxLatency(us), 27039
[READ], 95thPercentileLatency(us), 281
[READ], 99thPercentileLatency(us), 400
[READ], Return=OK, 191769
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1100.0
[CLEANUP], MinLatency(us), 1100
[CLEANUP], MaxLatency(us), 1100
[CLEANUP], 95thPercentileLatency(us), 1100
[CLEANUP], 99thPercentileLatency(us), 1100
[UPDATE], Operations, 192256
[UPDATE], AverageLatency(us), 155.3919929677097
[UPDATE], MinLatency(us), 56
[UPDATE], MaxLatency(us), 38847
[UPDATE], 95thPercentileLatency(us), 281
[UPDATE], 99thPercentileLatency(us), 410
[UPDATE], Return=OK, 192256
AUTOTEST_DONE